src/DataProcessors/ЗагрузкаСтруктурыКонфигурацииИзФайловXML/ЗагрузкаСтруктурыКонфигурацииИзФайловXML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="84820387-a043-4a56-9ac6-78a5944e468e">
  <name>ЗагрузкаСтруктурыКонфигурацииИзФайловXML</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

src/Enums/ТипыОбъектов/ТипыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b00d3374-fba3-4dfd-a8b9-2e9192589501">
  <name>ТипыОбъектов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="9a8e9e82-d92a-4009-b106-ec0dad7bbfdc">
    <name>БизнесПроцесс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="28f6293b-0a76-4f8d-b741-d6a86e461c95">
    <name>Булево</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c96f080e-8e03-46df-92cf-899101180ccb">
    <name>Строка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="52776854-ef3f-4d53-9b46-b1f5921f3db5">
    <name>Число</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="85dae71e-5343-4aa2-ad48-5bafd0e77bf1">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0ef44e26-9f8a-4f9f-af9f-b045c498816a">
    <name>ХранилищеЗначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="edc93a94-df17-4565-a085-b9635011d6e4">
    <name>УникальныйИдентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3cc366d1-dec6-4c40-bc75-a26c1cc4d307">
    <name>Перечисление</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e59131cc-796f-4a59-b508-b7116216ed5f">
    <name>ЛюбаяСсылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="61c264b5-4a1a-4a85-9134-71d05b5ef74f">
    <name>Справочник</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f39eb3b4-764d-4e49-9149-79a08def2a0e">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b3b69793-028f-4701-963c-d2e5302d5e7b">
    <name>ПланВидовРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3817b5d5-5de7-4f12-85c4-5037b01e683d">
    <name>ПланВидовХарактеристик</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e46ff655-d737-4f7e-99a8-70bdd157c150">
    <name>ПланОбмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="556282ca-df4a-4d71-b417-48193ff98076">
    <name>ПланСчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="666398bf-eff8-4172-9c11-f7e1a1382499">
    <name>ТочкаМаршрутаБизнесПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d4ec2030-fa42-4716-a9e9-87a282796ebb">
    <name>Задача</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bf7d940d-ea2d-4e76-9a9b-17544835afee">
    <name>ВидРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b65ce0b2-9d46-44a6-8beb-4b6114c07627">
    <name>ВидСубконто</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/DataProcessors/ЗагрузкаСтруктурыКонфигурацииИзФайловXML/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ЗагрузитьОбъектМетаданных")
Процедура кфк_ЗагрузитьОбъектМетаданных(ОбщиеПеременные, ТекущийРодитель, ВложенныйФайл, ПрефиксИменЭлементов, ТипОбъекта)
	ДанныеОбъекта = Новый Структура();
	ДанныеОбъекта.Вставить("ИмяЗадачиБизнесПроцесса", "");
	ДанныеОбъекта.Вставить("ПланСчетов", "");
	ДанныеОбъекта.Вставить("ПериодичностьРегистраСведений", "");
	ДанныеОбъекта.Вставить("РежимЗаписиРегистраСведений", "");
	ДанныеОбъекта.Вставить("ПланВидовРасчета", "");
	ДанныеОбъекта.Вставить("Корреспонденция", Ложь);
	ДанныеОбъекта.Вставить("ЕстьБазовыйПериод", Ложь);
	ДанныеОбъекта.Вставить("ЕстьПериодДействия", Ложь);
	ДанныеОбъекта.Вставить("ТипыВладельца", Новый Массив);
	ДанныеОбъекта.Вставить("МассивРегистров", Новый Массив);
	ДанныеОбъекта.Вставить("ТипыЗначенийХарактеристик", Новый Массив);
	ДанныеОбъекта.Вставить("ПредопределенныеСвойства", Новый Структура);
	ДанныеОбъекта.Вставить("ТекущийРодитель", ТекущийРодитель);
	ДанныеОбъекта.Вставить("ПрефиксИменЭлементов", ПрефиксИменЭлементов);
	ДанныеОбъекта.Вставить("ТипОбъекта", ТипОбъекта);
	ДанныеОбъекта.Вставить("ЗапрещеноПроведениеДокумента", Ложь);
	ДанныеОбъекта.Вставить("ДобавленНовый", Ложь);
	ДанныеОбъекта.Вставить("ТипРегистраНакопления", Неопределено);

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ВложенныйФайл.ТекущееИмяФайла);

	Если ОбщиеПеременные.ИсточникДанных = 0 Тогда
		ТекОбъект = ПрочитатьСведенияОбОбъектеИзXML(ЧтениеXML, ДанныеОбъекта, ОбщиеПеременные);
	Иначе
		ТекОбъект = ПрочитатьСведенияОбОбъектеИзEDT(ЧтениеXML, ДанныеОбъекта, ОбщиеПеременные);
	КонецЕсли;
	Если ТекОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ДанныеОбъекта.ДобавленНовый Или НЕ ОбщиеПеременные.ТолькоДобавлятьНовые
		Или НЕ ОбщиеПеременные.ТолькоОбновитьПланыОбмена Тогда
		Если ЗначениеЗаполнено(ДанныеОбъекта.ИмяЗадачиБизнесПроцесса) Тогда
			// Бизнес - процесс, привязка к задаче. Надо заполнить тип свойства БизнесПроцесс у соотв задачи.
			ПривязатьБизнесПроцессКЗадаче(ДанныеОбъекта.ИмяЗадачиБизнесПроцесса, ТекОбъект.Ссылка, ОбщиеПеременные);
		КонецЕсли;
	КонецЕсли;
	Если ДанныеОбъекта.МассивРегистров.Количество() > 0 Тогда
		Для Каждого Регистр Из ДанныеОбъекта.МассивРегистров Цикл
			СтрокаТЗ = ОбщиеПеременные.РегистраторыИРегистры.Добавить();
			СтрокаТЗ.Регистратор = ТекОбъект.Ссылка;
			СтрокаТЗ.Регистр = Регистр;
			СтрокаТЗ.ЗапрещеноПроведениеДокумента = ДанныеОбъекта.ЗапрещеноПроведениеДокумента;
		КонецЦикла;
	КонецЕсли;
	// Дочерние объекты (свойства).
	// Предопределенные свойства для разных типов объектов.
	Если НЕ ДанныеОбъекта.ДобавленНовый И ОбщиеПеременные.ТолькоДобавлятьНовые Тогда
		ОбщиеПеременные.Вставить("СоздаватьПредопределенныеСвойства", Ложь);
	Иначе
		ОбщиеПеременные.Вставить("СоздаватьПредопределенныеСвойства", Истина);
	КонецЕсли;
	#Вставка
	Если ТипОбъекта = Перечисления.ТипыОбъектов.Справочник Или ТипОбъекта = Перечисления.ТипыОбъектов.Документ
		Или ТипОбъекта = Перечисления.ТипыОбъектов.ПланВидовРасчета Или ТипОбъекта = Перечисления.ТипыОбъектов.ПланСчетов
		Или ТипОбъекта = Перечисления.ТипыОбъектов.БизнесПроцесс Или ТипОбъекта = Перечисления.ТипыОбъектов.Задача
		Или ТипОбъекта = Перечисления.ТипыОбъектов.ПланВидовХарактеристик Тогда
		ДобавитьПредопределенноеСвойство("Ссылка", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, ТекОбъект.Ссылка);
	КонецЕсли;
	#КонецВставки
	Если ДанныеОбъекта.ТипыВладельца.Количество() > 0 Тогда
		ДобавитьПредопределенноеСвойство("Владелец", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, ДанныеОбъекта.ТипыВладельца);
	КонецЕсли;
	Если ТекОбъект.Иерархический Тогда
		Если ТекОбъект.ВидИерархии <> "ИерархияЭлементов" Тогда
			ДобавитьПредопределенноеСвойство("ЭтоГруппа", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Булево");
		КонецЕсли;
		ДобавитьПредопределенноеСвойство("Родитель", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, ТекОбъект.Ссылка);
	КонецЕсли;
	Если ТипОбъекта = Перечисления.ТипыОбъектов.Документ Тогда
		ДобавитьПредопределенноеСвойство("Проведен", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Булево");
		ДобавитьПредопределенноеСвойство("ПометкаУдаления", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Булево");
		ДанныеОбъекта.ПредопределенныеСвойства.Вставить("Дата", Новый Структура("КвалификаторыДаты_Состав", "Дата и время"));
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.Справочник
		Или ТипОбъекта = Перечисления.ТипыОбъектов.ПланВидовХарактеристик Тогда
		ДобавитьПредопределенноеСвойство("ПометкаУдаления", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Булево");
		ДобавитьПредопределенноеСвойство("Предопределенный", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Реквизит, ОбщиеПеременные, "Булево");
		#Вставка
		//@skip-check undefined-function-or-procedure
		ДобавитьПредопределенноеСвойство("ИмяПредопределенныхДанных", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Реквизит, ОбщиеПеременные, "Строка");
		#КонецВставки
		Если ТипОбъекта = Перечисления.ТипыОбъектов.ПланВидовХарактеристик И ДанныеОбъекта.ТипыЗначенийХарактеристик.Количество() > 0 Тогда
			ДобавитьПредопределенноеСвойство("ТипЗначения", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Реквизит, ОбщиеПеременные, ДанныеОбъекта.ТипыЗначенийХарактеристик);
		КонецЕсли;
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.БизнесПроцесс Тогда
		ДобавитьПредопределенноеСвойство("Стартован", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Булево");
		ДобавитьПредопределенноеСвойство("Завершен", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Булево");
		ДобавитьПредопределенноеСвойство("ВедущаяЗадача", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные);
		ДанныеОбъекта.ПредопределенныеСвойства.Вставить("Дата", Новый Структура("КвалификаторыДаты_Состав", "Дата и время"));
		ДобавитьПредопределенноеСвойство("ПометкаУдаления", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Булево");
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.Задача Тогда
		ДобавитьПредопределенноеСвойство("Выполнена", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Булево");
		ДанныеОбъекта.ПредопределенныеСвойства.Вставить("Дата", Новый Структура("КвалификаторыДаты_Состав", "Дата и время"));
		ДобавитьПредопределенноеСвойство("ПометкаУдаления", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Булево");
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.РегистрБухгалтерии Тогда
		ДобавитьПредопределенноеСвойство("Период", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Дата");
		ДобавитьПредопределенноеСвойство("Активность", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Булево");
		ДобавитьПредопределенноеСвойство("Регистратор", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные);
		// Счета
		Если ДанныеОбъекта.Корреспонденция Тогда
			ДобавитьПредопределенноеСвойство("СчетДт", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, ДанныеОбъекта.ПланСчетов);
			ДобавитьПредопределенноеСвойство("СчетКт", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, ДанныеОбъекта.ПланСчетов);
			ДобавитьПредопределенноеСвойство("СубконтоДт", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.ВидыСубконтоСчета, ОбщиеПеременные);
			ДобавитьПредопределенноеСвойство("СубконтоКт", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.ВидыСубконтоСчета, ОбщиеПеременные);
		Иначе
			ДобавитьПредопределенноеСвойство("Счет", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, ДанныеОбъекта.ПланСчетов);
			ДобавитьПредопределенноеСвойство("Субконто", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.ВидыСубконтоСчета, ОбщиеПеременные);
		КонецЕсли;
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.РегистрНакопления Тогда
		ДобавитьПредопределенноеСвойство("Период", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Дата");
		ДобавитьПредопределенноеСвойство("Активность", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Булево");
		ДобавитьПредопределенноеСвойство("Регистратор", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные);
		Если ДанныеОбъекта.ТипРегистраНакопления = "Остатки" Тогда
			ДобавитьПредопределенноеСвойство("ВидДвижения", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные);
		КонецЕсли;
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.РегистрСведений Тогда
		ДобавитьПредопределенноеСвойство("Активность", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Булево");
		Если ДанныеОбъекта.ПериодичностьРегистраСведений <> "Nonperiodical" Тогда
			ДобавитьПредопределенноеСвойство("Период", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Дата");
		КонецЕсли;
		Если ДанныеОбъекта.РежимЗаписиРегистраСведений = "RecorderSubordinate" Тогда
			ДобавитьПредопределенноеСвойство("Регистратор", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные);
		КонецЕсли;
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.РегистрРасчета Тогда
		ДобавитьПредопределенноеСвойство("ПериодРегистрации", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Дата");
		ДобавитьПредопределенноеСвойство("Активность", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Булево");
		ДобавитьПредопределенноеСвойство("Сторно", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Булево");
		ДобавитьПредопределенноеСвойство("Регистратор", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные);
		ДобавитьПредопределенноеСвойство("ВидРасчета", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, ДанныеОбъекта.ПланВидовРасчета);
		Если ДанныеОбъекта.ЕстьПериодДействия Тогда
			ДобавитьПредопределенноеСвойство("ПериодДействия", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Дата");
			ДобавитьПредопределенноеСвойство("ПериодДействияНачало", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Дата");
			ДобавитьПредопределенноеСвойство("ПериодДействияКонец", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Дата");
		КонецЕсли;
		Если ДанныеОбъекта.ЕстьБазовыйПериод Тогда
			ДобавитьПредопределенноеСвойство("БазовыйПериодНачало", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Дата");
			ДобавитьПредопределенноеСвойство("БазовыйПериодКонец", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Дата");
		КонецЕсли;
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.ПланВидовРасчета Тогда
		Если ДанныеОбъекта.ЕстьПериодДействия Тогда
			ДобавитьПредопределенноеСвойство("ПериодДействияБазовый", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Булево");
		КонецЕсли;
		ДобавитьПредопределенноеСвойство("ПометкаУдаления", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Булево");
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.ПланОбмена Тогда
		ДобавитьПредопределенноеСвойство("ПометкаУдаления", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Булево");
		ДобавитьПредопределенноеСвойство("ЭтотУзел", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Булево");
		КвалификаторыНомера = Новый Структура("КвалификаторыЧисла_Неотрицательное", Истина);
		ДанныеОбъекта.ПредопределенныеСвойства.Вставить("НомерОтправленного", КвалификаторыНомера);
		ДанныеОбъекта.ПредопределенныеСвойства.Вставить("НомерПринятого", КвалификаторыНомера);
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.ПланСчетов Тогда
		ДобавитьПредопределенноеСвойство("Забалансовый", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Булево");
		ДобавитьПредопределенноеСвойство("ПометкаУдаления", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Булево");
		ДобавитьПредопределенноеСвойство("Предопределенный", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные, "Булево");
		#Вставка
		//@skip-check undefined-function-or-procedure
		ДобавитьПредопределенноеСвойство("ИмяПредопределенныхДанных", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Реквизит, ОбщиеПеременные, "Строка");
		#КонецВставки
	КонецЕсли;
	Для Каждого ПС Из ДанныеОбъекта.ПредопределенныеСвойства Цикл
		ДобавитьПредопределенноеСвойство(ПС.Ключ, ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство, ОбщиеПеременные,, ПС.Значение);
	КонецЦикла;
	ДанныеОбъекта.Вставить("ТекОбъект", ТекОбъект);
	// Продолжение чтения данных из файла.
	Если ОбщиеПеременные.ИсточникДанных = 0 Тогда
		ПозицияТочки = СтрНайти(ВложенныйФайл.ИсходноеИмяФайла, ".", НаправлениеПоиска.СКонца);
		Если ПозицияТочки > 0 Тогда
			ДанныеОбъекта.Вставить("ПутьКПодчиненным", Лев(ВложенныйФайл.ИсходноеИмяФайла, ПозицияТочки - 1));
		КонецЕсли;
		ПрочитатьСведенияОСвойствахИзXML(ЧтениеXML, ДанныеОбъекта, ОбщиеПеременные);
	Иначе
		ПрочитатьСведенияОСвойствахИзEDT(ЧтениеXML, ДанныеОбъекта, ОбщиеПеременные);
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ПрочитатьСведенияОСвойствахИзXML")
Процедура кфк_ПрочитатьСведенияОСвойствахИзXML(ЧтениеXML, ДанныеОбъекта, ОбщиеПеременные)
	ТекОбъект = ДанныеОбъекта.ТекОбъект;
	ЧтениеXML.Прочитать();

	ТекСвойство = Неопределено;
	ТекЗначение = Неопределено;
	ТекГруппа = Неопределено;
	ТекТипыСвойства = Новый Массив;
	ТекущийРодительСвойства = Неопределено;
	ЭтоТЧ = Ложь;
	ЭтоЗначение = Ложь;
	УИДСвойства = "";

	Если ЧтениеXML.Имя = "ChildObjects" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
		Пока ЧтениеXML.Прочитать() Цикл
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				Если ЧтениеXML.Имя = "TabularSection" Тогда
					ЭтоТЧ = Истина;
					УИДСвойства = одАтрибут(ЧтениеXML, "uuid");
					ЧтениеXML.Прочитать(); // InternalInfo
					ЧтениеXML.Пропустить();
					ЧтениеXML.Прочитать(); // Properties
					ТекГруппа = Справочники.Свойства.СоздатьГруппу();
					ТекГруппа.Владелец = ТекОбъект.Ссылка;
					ТекГруппа.Вид = Перечисления.ВидыСвойств.ТабличнаяЧасть;
					Продолжить;
				ИначеЕсли ЧтениеXML.Имя = "Command" Тогда
					ЧтениеXML.Пропустить();
					Продолжить;
				ИначеЕсли ЧтениеXML.Имя = "Attribute"
					Или ЧтениеXML.Имя = "Dimension"
					Или ЧтениеXML.Имя = "Resource"
					Или (ЧтениеXML.Имя = "AccountingFlag" И ДанныеОбъекта.ТипОбъекта <> Перечисления.ТипыОбъектов.РегистрБухгалтерии) Тогда
					ТекСвойство = Справочники.Свойства.СоздатьЭлемент();
					ТекСвойство.Владелец = ТекОбъект.Ссылка;
					Если ЧтениеXML.Имя = "Attribute" Или ЧтениеXML.Имя = "AccountingFlag" Тогда
						ТекСвойство.Вид = Перечисления.ВидыСвойств.Реквизит;
						Если ТекущийРодительСвойства <> Неопределено Тогда
							ТекСвойство.Родитель = ТекущийРодительСвойства;
						КонецЕсли;
					ИначеЕсли ЧтениеXML.Имя = "Dimension" Тогда
						ТекСвойство.Вид = Перечисления.ВидыСвойств.Измерение;
						Баланс = Ложь;
					ИначеЕсли ЧтениеXML.Имя = "Resource" Тогда
						ТекСвойство.Вид = Перечисления.ВидыСвойств.Ресурс;
						Баланс = Ложь;
					КонецЕсли;
					ТекТипыСвойства = Новый Массив;
					УИДСвойства = одАтрибут(ЧтениеXML, "uuid");
				ИначеЕсли ЧтениеXML.Имя = "EnumValue" Тогда
					ЭтоЗначение = Истина;
					ЭтоТЧ = Ложь;
					ТекСвойство = Справочники.Значения.СоздатьЭлемент();
					ТекСвойство.Владелец = ТекОбъект.Ссылка;
					ТекСвойство.Предопределенное = Истина;
					УИДСвойства = одАтрибут(ЧтениеXML, "uuid");
				ИначеЕсли ЧтениеXML.Имя = "Name" Тогда
					Если ТекГруппа = Неопределено И ТекСвойство = Неопределено Тогда
						ЧтениеXML.Пропустить();
						Продолжить;
					КонецЕсли;
					Наименование = одЗначениеЭлемента(ЧтениеXML);
					Если ЭтоТЧ Тогда
						ТекГруппа.Наименование = Наименование;
						ТекГруппа.Идентификатор = УИДСвойства;
					Иначе
						ТекСвойство.Наименование = Наименование;
						ТекСвойство.Идентификатор = УИДСвойства;
					КонецЕсли;
				ИначеЕсли ЧтениеXML.Имя = "Synonym" Тогда
					Если ТекГруппа = Неопределено И ТекСвойство = Неопределено Тогда
						ЧтениеXML.Пропустить();
						Продолжить;
					КонецЕсли;

					ТекСиноним = ПрочитатьСиноним(ЧтениеXML);
					Если ЭтоТЧ Тогда
						ТекГруппа.Синоним = ТекСиноним;
					Иначе
						ТекСвойство.Синоним = ТекСиноним;
					КонецЕсли;
				ИначеЕсли ЧтениеXML.Имя = "Comment" Тогда
					Если ТекГруппа = Неопределено И ТекСвойство = Неопределено Тогда
						ЧтениеXML.Пропустить();
						Продолжить;
					КонецЕсли;
					Если ЭтоТЧ Тогда
						ТекГруппа.Комментарий = одЗначениеЭлемента(ЧтениеXML);
					Иначе
						ТекСвойство.Комментарий = одЗначениеЭлемента(ЧтениеXML);
					КонецЕсли;
				ИначеЕсли НРег(ЧтениеXML.Имя) = "indexing" Тогда
					ЗаполнитьДанныеОбИндексированииИзXML(ЧтениеXML, ТекСвойство);
				ИначеЕсли ЧтениеXML.Имя = "Type" Тогда
					Если ТекГруппа = Неопределено И ТекСвойство = Неопределено Тогда
						ЧтениеXML.Пропустить();
						Продолжить;
					КонецЕсли;
					Квалификаторы = Новый Структура;
					ПростойТип = "";
					ПрочитатьТипы(ЧтениеXML, ТекТипыСвойства, ПростойТип, Квалификаторы);
					Для Каждого Квалификатор Из Квалификаторы Цикл
						ТекСвойство[Квалификатор.Ключ] = Квалификатор.Значение;
					КонецЦикла;
					Если ПростойТип <> "" Тогда
						ЗаполнитьПростойТипСвойства(ОбщиеПеременные, ТекСвойство, ПростойТип, ТекТипыСвойства);
					КонецЕсли;
				ИначеЕсли ЧтениеXML.Имя = "Balance" Тогда
					// Регистр бухгалтерии, Балансовое или не балансовое измерение/ресурс.
					Баланс = одЗначениеЭлемента(ЧтениеXML, Тип("Булево"));
				КонецЕсли;
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
				Если ЧтениеXML.Имя = "Attribute" Или ЧтениеXML.Имя = "Dimension"
					Или ЧтениеXML.Имя = "Resource"
					Или (ЧтениеXML.Имя = "AccountingFlag" И ДанныеОбъекта.ТипОбъекта <> Перечисления.ТипыОбъектов.РегистрБухгалтерии) Тогда
					Если (ЧтениеXML.Имя <> "Attribute" И ЧтениеXML.Имя <> "AccountingFlag")
						И ДанныеОбъекта.ТипОбъекта = Перечисления.ТипыОбъектов.РегистрБухгалтерии
						И ДанныеОбъекта.Корреспонденция
						И НЕ Баланс Тогда
						// Измерения/ресурса два - Дт и Кт
						// УИД очищаем т.к. становится не информативно.
						ИсходноеИмя = ТекСвойство.Наименование;
						ТекСвойство.Идентификатор = "";
						ТекСвойствоСсылка = ПереопределитьСвойствоИлиЗначение(ТекСвойство, ОбщиеПеременные, Ложь, ИсходноеИмя + "Дт");
						ДобавитьТипВОтложенноеЗаполнение(ОбщиеПеременные, ТекСвойствоСсылка, ТекТипыСвойства);

						// Создаем второе свойство
						ТекСвойствоНов = ТекСвойство.Скопировать();
						ТекСвойствоНов.Наименование = ИсходноеИмя + "Кт";
						ТекСвойствоСсылка = ПереопределитьСвойствоИлиЗначение(ТекСвойствоНов, ОбщиеПеременные, Ложь, ИсходноеИмя + "Кт");
						ДобавитьТипВОтложенноеЗаполнение(ОбщиеПеременные, ТекСвойствоСсылка, ТекТипыСвойства);
					Иначе
						ТекСвойствоСсылка = ПереопределитьСвойствоИлиЗначение(ТекСвойство, ОбщиеПеременные, Ложь);
						ДобавитьТипВОтложенноеЗаполнение(ОбщиеПеременные, ТекСвойствоСсылка, ТекТипыСвойства);
					КонецЕсли;
				ИначеЕсли ЧтениеXML.Имя = "Properties" И ЭтоТЧ Тогда
					ТекГруппаСсылка = ПереопределитьСвойствоИлиЗначение(ТекГруппа, ОбщиеПеременные, Истина);
					ЭтоТЧ = Ложь;
					ТекущийРодительСвойства = ТекГруппаСсылка;
					#Вставка
					ДобавитьПредопределенноеСвойство("Ссылка", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство,
						ОбщиеПеременные, ТекОбъект.Ссылка, , ТекущийРодительСвойства);
					ДобавитьПредопределенноеСвойство("НомерСтроки", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство,
						ОбщиеПеременные, "Число", , ТекущийРодительСвойства);
					#КонецВставки
				ИначеЕсли ЧтениеXML.Имя = "TabularSection" Тогда
					ТекущийРодитель = Неопределено;
					ЭтоТЧ = Ложь;
					ТекущийРодительСвойства = Неопределено;
					ТекГруппа = Ложь;
				ИначеЕсли ЧтениеXML.Имя = "EnumValue" Тогда
					ПереопределитьСвойствоИлиЗначение(ТекСвойство, ОбщиеПеременные);
					ЭтоЗначение = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ЧтениеXML.Закрыть();
	Если ДанныеОбъекта.ТипОбъекта = Перечисления.ТипыОбъектов.Справочник
		Или ДанныеОбъекта.ТипОбъекта = Перечисления.ТипыОбъектов.ПланВидовРасчета
		Или ДанныеОбъекта.ТипОбъекта = Перечисления.ТипыОбъектов.ПланВидовХарактеристик
		Или ДанныеОбъекта.ТипОбъекта = Перечисления.ТипыОбъектов.ПланСчетов Тогда
		// Предопределенные значения в отдельном файле.
		Если НЕ ДанныеОбъекта.Свойство("ПутьКПодчиненным") Тогда
			Возврат;
		КонецЕсли;
		ПутьКПредопределенным = ДанныеОбъекта.ПутьКПодчиненным + ОбщиеПеременные.РазделительПути + "Ext" + ОбщиеПеременные.РазделительПути + "Predefined.xml";
		ФайлСПредопределенными = НайтиПомещенныеФайлыПоИмени(ОбщиеПеременные, ПутьКПредопределенным);
		Если ФайлСПредопределенными = "" Тогда
			Возврат;
		КонецЕсли;

		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ФайлСПредопределенными);
		ИерархияЗначений = Новый Массив;

		Пока ЧтениеXML.Прочитать() Цикл
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				Если ЧтениеXML.Имя = "Item" Тогда
					Если ТекСвойство <> Неопределено Тогда
						Если НЕ ЗначениеЗаполнено(ТекСвойство.Ссылка) Тогда
							ТекСвойство.Записать();
						КонецЕсли;
						ИерархияЗначений.Добавить(ТекСвойство.Ссылка);
					КонецЕсли;

					ТекСвойство = Справочники.Значения.СоздатьЭлемент();
					ТекСвойство.Владелец = ТекОбъект.Ссылка;
					ТекСвойство.Предопределенное = Истина;
					УИДСвойства = одАтрибут(ЧтениеXML, "uuid");
					Если ИерархияЗначений.Количество() > 0 Тогда
						ТекСвойство.Родитель = ИерархияЗначений[ИерархияЗначений.Количество() - 1];
					КонецЕсли;
				ИначеЕсли ЧтениеXML.Имя = "Name" Тогда
					Наименование = одЗначениеЭлемента(ЧтениеXML);
					// Пробуем найти существующее значение.
					СвойствоСсылка = Неопределено;
					НайденоПоУИД = Истина;
					Если ЗначениеЗаполнено(УИДСвойства) И ОбщиеПеременные.СинхронизироватьПоУИД Тогда
						СвойствоСсылка = Справочники.Значения.НайтиПоРеквизиту("Идентификатор", УИДСвойства,, ТекОбъект.Ссылка);
					КонецЕсли;
					Если НЕ ЗначениеЗаполнено(СвойствоСсылка) Тогда
						НайденоПоУИД = Ложь;
						СвойствоСсылка = Справочники.Значения.НайтиПоНаименованию(Наименование, Истина,, ТекОбъект.Ссылка);
					КонецЕсли;
					Если ЗначениеЗаполнено(СвойствоСсылка)
						И (НайденоПоУИД Или НЕ ЗначениеЗаполнено(СвойствоСсылка.Идентификатор) Или ОбщиеПеременные.ЭтоРасширение) Тогда
						// Переопределяем переменную содержащую текущее значение.
						ТекущийРодитель = ТекСвойство.Родитель;
						ТекСвойство = СвойствоСсылка.ПолучитьОбъект();
						Если ТекСвойство.ПометкаУдаления Тогда
							ТекСвойство.ПометкаУдаления = Ложь;
						КонецЕсли;
						Если НЕ НайденоПоУИД Тогда
							ТекСвойство.Идентификатор = УИДСвойства;
						КонецЕсли;
						ТекСвойство.Наименование = Наименование;
						ТекСвойство.Родитель = ТекущийРодитель;
						УдалитьОбъектИзСписка(СвойствоСсылка, ОбщиеПеременные.СуществующиеЗначения);
					Иначе
						ТекСвойство.Наименование = Наименование;
						ТекСвойство.Идентификатор = УИДСвойства;
					КонецЕсли;
				ИначеЕсли ЧтениеXML.Имя = "Description" Тогда
					ТекСвойство.Синоним = одЗначениеЭлемента(ЧтениеXML);
				ИначеЕсли ЧтениеXML.Имя = "ChildItems" Тогда
					Продолжить;
				КонецЕсли;
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента
				И ЧтениеXML.Имя = "Item" Тогда
				Если ТекСвойство = Неопределено Тогда
					Если  ИерархияЗначений.Количество() > 0 Тогда
						ИерархияЗначений.Удалить(ИерархияЗначений.Количество()-1);
					КонецЕсли;
				Иначе
					ТекСвойство.Записать();
					ТекСвойство = Неопределено;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ДанныеОбъекта.ТипОбъекта = Перечисления.ТипыОбъектов.ПланОбмена Тогда
		// Состав в отдельном файле.
		Если НЕ ДанныеОбъекта.Свойство("ПутьКПодчиненным") Тогда
			Возврат;
		КонецЕсли;

		ПутьКСоставу = ДанныеОбъекта.ПутьКПодчиненным + ОбщиеПеременные.РазделительПути + "Ext" + ОбщиеПеременные.РазделительПути + "Content.xml";
		ФайлССоставом = НайтиПомещенныеФайлыПоИмени(ОбщиеПеременные, ПутьКСоставу);
		Если ФайлССоставом = "" Тогда
			Возврат;
		КонецЕсли;
		ТЧСоставСсылка = Справочники.Свойства.НайтиПоНаименованию("{Состав}", Истина,, ТекОбъект.Ссылка);
		Если ЗначениеЗаполнено(ТЧСоставСсылка) Тогда
			Если ТЧСоставСсылка.ПометкаУдаления Тогда
				ТЧСоставОбъект = ТЧСоставСсылка.ПолучитьОбъект();
				ТЧСоставОбъект.ПометкаУдаления = Ложь;
				ТЧСоставОбъект.Записать();
			КонецЕсли;
			УдалитьОбъектИзСписка(ТЧСоставСсылка, ОбщиеПеременные.СуществующиеСвойства);
		Иначе
			ТЧСоставОбъект = Справочники.Свойства.СоздатьГруппу();
			ТЧСоставОбъект.Владелец = ТекОбъект.Ссылка;
			ТЧСоставОбъект.Наименование = "{Состав}";
			ТЧСоставОбъект.Синоним = "{Состав}";
			ТЧСоставОбъект.Вид = Перечисления.ВидыСвойств.СоставПланаОбмена;
			ТЧСоставОбъект.Записать();
			ТЧСоставСсылка = ТЧСоставОбъект.Ссылка;
		КонецЕсли;

		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ФайлССоставом);
		ЧтениеXML.Прочитать(); // ExchangePlanContent
		Пока НЕ (ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента
				И ЧтениеXML.Имя = "ExchangePlanContent") Цикл
			Если  ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
				И ЧтениеXML.Имя = "Metadata" Тогда
				ИмяОбъекта = одЗначениеЭлемента(ЧтениеXML);
				РодительОбъекта = Неопределено;
				СвойствоОбъект = Неопределено;
				ПолноеИмяОбъекта = ПреобразоватьИмяТипаВИмяОбъекта(ИмяОбъекта, РодительОбъекта, ОбщиеПеременные);
				Если ЗначениеЗаполнено(ПолноеИмяОбъекта) Тогда
					ОбъектСсылка = Справочники.Объекты.НайтиПоНаименованию(ПолноеИмяОбъекта, Истина, РодительОбъекта,ОбщиеПеременные.Конфигурация);
					Если ЗначениеЗаполнено(ОбъектСсылка) Тогда
						НайтиСоздатьЭлементСоставаПланаОбмена(ОбъектСсылка, ОбщиеПеременные, ТекОбъект.Ссылка, ТЧСоставСсылка);
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
				И ЧтениеXML.Имя = "AutoRecord" И СвойствоОбъект <> Неопределено Тогда
				АвторегистрацияСтрокой = одЗначениеЭлемента(ЧтениеXML);
				СвойствоОбъект.Авторегистрация = (АвторегистрацияСтрокой <> "Deny");
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента
				И ЧтениеXML.Имя = "Item" И СвойствоОбъект <> Неопределено Тогда
				СвойствоОбъект.Записать();
				ЧтениеXML.Прочитать();
			Иначе
				ЧтениеXML.Прочитать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ЧтениеXML.Закрыть();

КонецПроцедуры

&ИзменениеИКонтроль("ПрочитатьСведенияОСвойствахИзEDT")
Процедура кфк_ПрочитатьСведенияОСвойствахИзEDT(ЧтениеXML, ДанныеОбъекта, ОбщиеПеременные)
	ТекОбъект = ДанныеОбъекта.ТекОбъект;

	ТекСвойство = Неопределено;
	СтруктураХраненияТипов = Новый Структура;
	ТекЗначение = Неопределено;
	ТекГруппа = Неопределено;
	ТекТипыСвойства = Новый Массив;
	ТекущийРодительСвойства = Неопределено;
	ИерархияЗначений = Новый Массив;
	ЭтоТЧ = Ложь;
	ЭтоЗначение = Ложь;
	УИДСвойства = "";
	ТЧСоставСсылка = Неопределено;

	МенеджерВариантыИндексирования = Перечисления.ВариантыИндексирования;

	Если НЕ ЗначениеЗаполнено(ЧтениеXML.Имя) Тогда
		ЧтениеXML.Пропустить();
	КонецЕсли;
	Пока ЧтениеXML.Имя <> "mdclass" И ЗначениеЗаполнено(ЧтениеXML.Имя) Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если ЧтениеXML.Имя = "tabularSections" Тогда
				ЭтоТЧ = Истина;
				УИДСвойства = одАтрибут(ЧтениеXML, "uuid");
				ЧтениеXML.Прочитать(); // producedTypes
				ЧтениеXML.Пропустить();
				ЧтениеXML.Прочитать(); // name
				ТекГруппа = Справочники.Свойства.СоздатьГруппу();
				ТекГруппа.Владелец = ТекОбъект.Ссылка;
				ТекГруппа.Наименование = ПрочитатьXML(ЧтениеXML, Тип("Строка"));
				ТекГруппа.Вид = Перечисления.ВидыСвойств.ТабличнаяЧасть;
				ТекГруппа.Идентификатор = УИДСвойства;
				ТекСвойство = Неопределено;
				ТекущийРодительСвойства = Неопределено;
				Продолжить;
			ИначеЕсли ЧтениеXML.Имя = "attributes"
				Или ЧтениеXML.Имя = "dimensions"
				Или ЧтениеXML.Имя = "resources" Тогда
				ТекСвойство = Справочники.Свойства.СоздатьЭлемент();
				ТекСвойство.Владелец = ТекОбъект.Ссылка;
				Если ЧтениеXML.Имя = "attributes" Тогда
					ТекСвойство.Вид = Перечисления.ВидыСвойств.Реквизит;
				ИначеЕсли ЧтениеXML.Имя = "dimensions" Тогда
					ТекСвойство.Вид = Перечисления.ВидыСвойств.Измерение;
					Баланс = Ложь;
				ИначеЕсли ЧтениеXML.Имя = "resources" Тогда
					ТекСвойство.Вид = Перечисления.ВидыСвойств.Ресурс;
					Баланс = Ложь;
				КонецЕсли;
				ТекТипыСвойства = Новый Массив;
				УИДСвойства = одАтрибут(ЧтениеXML, "uuid");
				ТекСвойство.Идентификатор = УИДСвойства;

				Если ЭтоТЧ Тогда
					Если ТекущийРодительСвойства = Неопределено Тогда
						ТекущийРодительСвойства = ПереопределитьСвойствоИлиЗначение(ТекГруппа, ОбщиеПеременные, Истина);
						#Вставка
						ДобавитьПредопределенноеСвойство("Ссылка", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство,
							ОбщиеПеременные, ТекОбъект.Ссылка, , ТекущийРодительСвойства);
						ДобавитьПредопределенноеСвойство("НомерСтроки", ТекОбъект.Ссылка, Перечисления.ВидыСвойств.Свойство,
							ОбщиеПеременные, "Число", , ТекущийРодительСвойства);
						#КонецВставки
					КонецЕсли;
					ТекСвойство.Родитель = ТекущийРодительСвойства;
				КонецЕсли;
			ИначеЕсли ЧтениеXML.Имя = "predefined" Тогда
				// Начало узла с предопределенными.
				// Читаем дальше.
			ИначеЕсли ЧтениеXML.Имя = "items"
				Или ЧтениеXML.Имя = "enumValues"
				Или (ЧтениеXML.Имя = "content" И ЭтоЗначение = Истина)
				Или (ЧтениеXML.Имя = "childItems" И ЭтоЗначение = Истина) Тогда
				ЭтоЗначение = Истина;
				ЭтоТЧ = Ложь;
				УИДСвойства = одАтрибут(ЧтениеXML, "uuid");
				ТекРодитель = Неопределено;
				Если ТекСвойство <> Неопределено Тогда
					ТекРодитель = ПереопределитьСвойствоИлиЗначение(ТекСвойство, ОбщиеПеременные);
					ИерархияЗначений.Добавить(ТекРодитель);
				КонецЕсли;
				ТекСвойство = Справочники.Значения.СоздатьЭлемент();
				ТекСвойство.Владелец = ТекОбъект.Ссылка;
				ТекСвойство.Предопределенное = Истина;
				ТекСвойство.Идентификатор = УИДСвойства;
				Если ИерархияЗначений.Количество() > 0 Тогда
					ТекСвойство.Родитель = ИерархияЗначений[ИерархияЗначений.Количество() - 1];
				КонецЕсли;
			ИначеЕсли ЧтениеXML.Имя = "name" Тогда
				Если ТекГруппа = Неопределено И ТекСвойство = Неопределено Тогда
					ЧтениеXML.Пропустить();
					Продолжить;
				КонецЕсли;
				Наименование = одЗначениеЭлемента(ЧтениеXML);
				Если ЭтоТЧ И ТекСвойство = Неопределено Тогда
					ТекГруппа.Наименование = Наименование;
				Иначе
					ТекСвойство.Наименование = Наименование;
				КонецЕсли;
			ИначеЕсли ЧтениеXML.Имя = "synonym" Тогда
				Если ТекГруппа = Неопределено И ТекСвойство = Неопределено Тогда
					ЧтениеXML.Пропустить();
					Продолжить;
				КонецЕсли;
				ТекСиноним = ПрочитатьСиноним(ЧтениеXML);
				Если ЭтоТЧ И ТекСвойство = Неопределено Тогда
					ТекГруппа.Синоним = ТекСиноним;
				Иначе
					ТекСвойство.Синоним = ТекСиноним;
				КонецЕсли;
			//Подсказка
			ИначеЕсли ЧтениеXML.Имя = "toolTip" Тогда
				Если ТекГруппа = Неопределено И ТекСвойство = Неопределено Тогда
					ЧтениеXML.Пропустить();
					Продолжить;
				КонецЕсли;

				ПодсказкаСтрокой = ПрочитатьСиноним(ЧтениеXML);

				Если ЭтоТЧ И ТекСвойство = Неопределено Тогда
					ТекГруппа.Подсказка = ПодсказкаСтрокой;
				Иначе
					ТекСвойство.Подсказка = ПодсказкаСтрокой;
				КонецЕсли;
			// Индексирование
			ИначеЕсли НРег(ЧтениеXML.Имя) = "indexing" Тогда
				ЗаполнитьДанныеОбИндексированииИзXML(ЧтениеXML, ТекСвойство);
			// Комментарий
			ИначеЕсли НРег(ЧтениеXML.Имя) = "comment" Тогда

				КомментарийСтрокой = ПрочитатьXML(ЧтениеXML, Тип("Строка"));

				Если ЭтоТЧ И ТекСвойство = Неопределено Тогда
					ТекГруппа.Комментарий = КомментарийСтрокой;
				Иначе
					ТекСвойство.Комментарий = КомментарийСтрокой;
				КонецЕсли;

				Продолжить;
			//
			ИначеЕсли НРег(ЧтениеXML.Имя) = "type" Тогда
				Если ТекГруппа = Неопределено И ТекСвойство = Неопределено Тогда
					ЧтениеXML.Пропустить();
					Продолжить;
				КонецЕсли;
				Квалификаторы = Новый Структура;
				ПростойТип = "";
				ПрочитатьТипы(ЧтениеXML, ТекТипыСвойства, ПростойТип, Квалификаторы);
				Если ТипЗнч(ТекСвойство) = Тип("СправочникОбъект.Значения") Тогда
					Продолжить;
				КонецЕсли;
				Для Каждого Квалификатор Из Квалификаторы Цикл
					ТекСвойство[Квалификатор.Ключ] = Квалификатор.Значение;
				КонецЦикла;
				Если ПростойТип <> "" Тогда
					ЗаполнитьПростойТипСвойства(ОбщиеПеременные, ТекСвойство, ПростойТип, ТекТипыСвойства);
				КонецЕсли;
			ИначеЕсли ЧтениеXML.Имя = "balance" Тогда
				// Регистр бухгалтерии, Балансовое или не балансовое измерение/ресурс.
				Баланс = одЗначениеЭлемента(ЧтениеXML, Тип("Булево"));
			ИначеЕсли ДанныеОбъекта.ТипОбъекта = Перечисления.ТипыОбъектов.ПланОбмена И ЧтениеXML.Имя = "content" Тогда
				// Состав плана обмена.
				Если ТЧСоставСсылка = Неопределено Тогда
					ТЧСоставСсылка = Справочники.Свойства.НайтиПоНаименованию("{Состав}", Истина,, ТекОбъект.Ссылка);
					Если ЗначениеЗаполнено(ТЧСоставСсылка) Тогда
						Если ТЧСоставСсылка.ПометкаУдаления Тогда
							ТЧСоставОбъект = ТЧСоставСсылка.ПолучитьОбъект();
							ТЧСоставОбъект.ПометкаУдаления = Ложь;
							ТЧСоставОбъект.Записать();
						КонецЕсли;
						УдалитьОбъектИзСписка(ТЧСоставСсылка, ОбщиеПеременные.СуществующиеСвойства);
					Иначе
						ТЧСоставОбъект = Справочники.Свойства.СоздатьГруппу();
						ТЧСоставОбъект.Владелец = ТекОбъект.Ссылка;
						ТЧСоставОбъект.Наименование = "{Состав}";
						ТЧСоставОбъект.Синоним = "{Состав}";
						ТЧСоставОбъект.Вид = Перечисления.ВидыСвойств.СоставПланаОбмена;
						ТЧСоставОбъект.Записать();
						ТЧСоставСсылка = ТЧСоставОбъект.Ссылка;
					КонецЕсли;
				КонецЕсли;
				ЧтениеXML.Прочитать(); // mdObject
				ИмяОбъектаМД = одЗначениеЭлемента(ЧтениеXML);
				РодительПО = Неопределено;
				СвойствоПО = Неопределено;
				ПолноеИмяОбъекта = ПреобразоватьИмяТипаВИмяОбъекта(ИмяОбъектаМД, РодительПО, ОбщиеПеременные);
				Если ЗначениеЗаполнено(ПолноеИмяОбъекта) Тогда
					ОбъектПОСсылка = Справочники.Объекты.НайтиПоНаименованию(ПолноеИмяОбъекта, Истина, РодительПО,ОбщиеПеременные.Конфигурация);
					Если ЗначениеЗаполнено(ОбъектПОСсылка) Тогда
						ДанныеТекОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектПОСсылка, "Имя, Синоним, Наименование");
					Иначе
						ДанныеТекОбъекта = Новый Структура("Имя, Синоним, Наименование");
						ДанныеТекОбъекта.Наименование = ПолноеИмяОбъекта;
						ПозТочки = СтрНайти(ПолноеИмяОбъекта, ".");
						Если ПозТочки > 0 Тогда
							ДанныеТекОбъекта.Синоним = Сред(ПолноеИмяОбъекта, ПозТочки + 1);
						Иначе
							ДанныеТекОбъекта.Синоним = ПолноеИмяОбъекта;
						КонецЕсли;
						ДанныеТекОбъекта.Имя = ДанныеТекОбъекта.Синоним;
					КонецЕсли;
					НайтиСоздатьЭлементСоставаПланаОбмена(ОбъектПОСсылка, ОбщиеПеременные, ТекОбъект.Ссылка, ТЧСоставСсылка);
				КонецЕсли;
			Иначе
				ЧтениеXML.Пропустить();
				Продолжить;
			КонецЕсли;
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Если ЧтениеXML.Имя = "attributes" Или ЧтениеXML.Имя = "dimensions"
				Или ЧтениеXML.Имя = "resources" Тогда
				Если ЧтениеXML.Имя <> "attributes"
					И ДанныеОбъекта.ТипОбъекта = Перечисления.ТипыОбъектов.РегистрБухгалтерии
					И ДанныеОбъекта.Корреспонденция
					И НЕ Баланс Тогда
					// Измерения/ресурса два - Дт и Кт
					// УИД очищаем т.к. становится не информативно.
					ИсходноеИмя = ТекСвойство.Наименование;
					ТекСвойство.Идентификатор = "";
					ТекСвойствоСсылка = ПереопределитьСвойствоИлиЗначение(ТекСвойство, ОбщиеПеременные, Ложь, ИсходноеИмя + "Дт");
					ДобавитьТипВОтложенноеЗаполнение(ОбщиеПеременные, ТекСвойствоСсылка, ТекТипыСвойства);

					// Создаем второе свойство
					ТекСвойствоНов = ТекСвойство.Скопировать();
					ТекСвойствоНов.Наименование = ИсходноеИмя + "Кт";
					ТекСвойствоСсылка = ПереопределитьСвойствоИлиЗначение(ТекСвойство, ОбщиеПеременные, Ложь, ИсходноеИмя + "Кт");
					ДобавитьТипВОтложенноеЗаполнение(ОбщиеПеременные, ТекСвойствоСсылка, ТекТипыСвойства);
				Иначе
					ТекСвойствоСсылка = ПереопределитьСвойствоИлиЗначение(ТекСвойство, ОбщиеПеременные, Ложь);
					ДобавитьТипВОтложенноеЗаполнение(ОбщиеПеременные, ТекСвойствоСсылка, ТекТипыСвойства);
					ТекСвойство = Неопределено;
				КонецЕсли;
			ИначеЕсли ЧтениеXML.Имя = "tabularSections" Тогда
				ЭтоТЧ = Ложь;
				ТекущийРодительСвойства = Неопределено;

			ИначеЕсли ЧтениеXML.Имя = "items" Или ЧтениеXML.Имя = "enumValues"
				Или ((ЧтениеXML.Имя = "content" Или ЧтениеXML.Имя = "childItems") И ЭтоЗначение) Тогда
				Если ТекСвойство = Неопределено Тогда
					Если ИерархияЗначений.Количество() > 0 Тогда
						ИерархияЗначений.Удалить(ИерархияЗначений.Количество() - 1);
					КонецЕсли;
				Иначе
					ПереопределитьСвойствоИлиЗначение(ТекСвойство, ОбщиеПеременные);
					ТекСвойство = Неопределено;
				КонецЕсли;
				Если (ЧтениеXML.Имя = "items" Или ЧтениеXML.Имя = "enumValues") Тогда
					ЭтоЗначение = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ЧтениеXML.Прочитать();
	КонецЦикла;
	ЧтениеXML.Закрыть();
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьДанныеОбИндексированииИзXML")
Процедура кфк_ЗаполнитьДанныеОбИндексированииИзXML(ЧтениеXML, ТекущееСвойство)

	МенеджерВариантыИндексирования = Перечисления.ВариантыИндексирования;

	#Удаление
	ИндексированиеСтрокой = ПрочитатьXML(ЧтениеXML, Тип("Строка"));
	#КонецУдаления
	#Вставка
	Если ЧтениеXML.Прочитать() И ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
		ИндексированиеСтрокой = ЧтениеXML.Значение;
	КонецЕсли;
	#КонецВставки

	Если НЕ ПустаяСтрока(ИндексированиеСтрокой) Тогда

		ТекущееСвойство.ВариантИндексирования =
						МенеджерВариантыИндексирования.ПолучитьВариантИндексированияПоСтроке(ИндексированиеСтрокой);
		ТекущееСвойство.Индексирование =
						(ТекущееСвойство.ВариантИндексирования <> МенеджерВариантыИндексирования.НеИндексировать);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
